------------------------------------------------------------------------------------------
      name:  SA
       log:  /Users/suhanaalam/Documents/ECO726/Project/replication.log
  log type:  text
 opened on:   7 Nov 2025, 15:11:09

. 
. import delimited "moservoena_replication.csv", clear // using replication csv
(encoding automatically selected: ISO-8859-1)
(9 vars, 471,120 obs)

. 
. * getting an overview of the data
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      grntyr |    471,120        1907    18.76168       1875       1939
   count_usa |    471,120    .3497262    1.148123          0         68
   count_for |    471,120    .1102203    .4857754          0         21
    count_cl |    471,120    .0271905    .2861856          0         15
    class_id |    471,120    235592.5    136000.8         65     471120
-------------+---------------------------------------------------------
       treat |    471,120    .0149771    .1214611          0          1
year_conf_~t |    471,120    1.160545    7.234953          0        244
count_cl_itt |    471,120    .1372899    .8368513          0         30
  count_cl_2 |    471,120    .0826414    1.991645          0        225

. describe

Contains data
 Observations:       471,120                  
    Variables:             9                  
------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------
grntyr          int     %8.0g                 
count_usa       byte    %8.0g                 
count_for       byte    %8.0g                 
count_cl        byte    %8.0g                 
class_id        long    %12.0g                
treat           byte    %8.0g                 
year_conf_itt   int     %8.0g                 
count_cl_itt    byte    %8.0g                 
count_cl_2      int     %8.0g                 
------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. *================================ TABLE 2 =====================================*
. 
. * creating the post-policy indicator/dummy variable
. gen post1919 = (grntyr>=1919) // checks if year is 1919 (pre treatment) or later

. label var post1919 "Post-1919 indicator"

. 
. tab post1919

  Post-1919 |
  indicator |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    318,912       67.69       67.69
          1 |    152,208       32.31      100.00
------------+-----------------------------------
      Total |    471,120      100.00

. 
. * creating DiD interaction variable
. gen did = treat * post1919 // equals 1 only for treated subclasses after 1919

. label var did "Treated x Post-1919 interaction" // measures policy's causal effect

. 
. tab treat post1919, summarize(did) // check to verify pattern

                Means, Standard Deviations and Frequencies
                    of Treated x Post-1919 interaction

           | Post-1919 indicator
     treat |         0          1 |     Total
-----------+----------------------+----------
         0 |         0          0 |         0
           |         0          0 |         0
           |    318912     145152 |    464064
-----------+----------------------+----------
         1 |         .          1 |         1
           |         .          0 |         0
           |         0       7056 |      7056
-----------+----------------------+----------
     Total |         0  .04635762 | .01497708
           |         0  .21025907 | .12146108
           |    318912     152208 |    471120

. 
. * setting up the panel
. xtset class_id grntyr // each subclass over yrs

Panel variable: class_id (strongly balanced)
 Time variable: grntyr, 1875 to 1939
         Delta: 1 unit

. 
. * clearing saved columns for new table
. eststo clear

. 
. * replicating column 1: DiD with foreign inventor controls
. xtreg count_usa did count_for i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0812                                         min =         65
     Between = 0.1534                                         avg =       65.0
     Overall = 0.0736                                         max =         65

                                                F(66, 7247)       =      45.19
corr(u_i, Xb) = 0.0648                          Prob > F          =     0.0000

                           (Std. err. adjusted for 7,248 clusters in class_id)
------------------------------------------------------------------------------
             |               Robust
   count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         did |    .150516   .0356081     4.23   0.000     .0807137    .2203183
   count_for |   .2830364   .0175523    16.13   0.000     .2486287    .3174441
             |
      grntyr |
       1876  |   .0043994   .0055806     0.79   0.431    -.0065402    .0153389
       1877  |     .00202   .0060472     0.33   0.738    -.0098342    .0138742
       1878  |  -.0134767    .005945    -2.27   0.023    -.0251307   -.0018228
       1879  |  -.0048342   .0060633    -0.80   0.425      -.01672    .0070516
       1880  |   .0039177   .0059702     0.66   0.512    -.0077856     .015621
       1881  |  -.0023406   .0062126    -0.38   0.706    -.0145191     .009838
       1882  |   .0342394   .0069457     4.93   0.000     .0206238    .0478549
       1883  |   .0550025   .0074583     7.37   0.000     .0403819     .069623
       1884  |   .0348277   .0074537     4.67   0.000     .0202163    .0494391
       1885  |   .0782828   .0081156     9.65   0.000     .0623738    .0941918
       1886  |   .0496347   .0072539     6.84   0.000      .035415    .0638544
       1887  |   .0357883   .0069916     5.12   0.000     .0220827    .0494939
       1888  |   .0371808   .0069185     5.37   0.000     .0236185    .0507431
       1889  |   .0605886   .0076479     7.92   0.000     .0455964    .0755808
       1890  |   .0798782   .0085099     9.39   0.000     .0631963    .0965601
       1891  |   .0627934   .0078096     8.04   0.000     .0474843    .0781025
       1892  |   .0381777   .0076117     5.02   0.000     .0232566    .0530989
       1893  |   .0660889   .0078102     8.46   0.000     .0507786    .0813991
       1894  |   .0285456    .007328     3.90   0.000     .0141807    .0429106
       1895  |   .0536536   .0077792     6.90   0.000      .038404    .0689031
       1896  |   .0551608   .0086413     6.38   0.000     .0382213    .0721002
       1897  |   .0661564   .0097986     6.75   0.000     .0469482    .0853646
       1898  |   .0300342   .0090939     3.30   0.001     .0122075     .047861
       1899  |   .0975553   .0102636     9.51   0.000     .0774357    .1176749
       1900  |   .0742827   .0090138     8.24   0.000     .0566131    .0919524
       1901  |   .0841204   .0093843     8.96   0.000     .0657245    .1025164
       1902  |   .0842766   .0087915     9.59   0.000     .0670428    .1015105
       1903  |   .1133855   .0093114    12.18   0.000     .0951326    .1316385
       1904  |   .1021427   .0091283    11.19   0.000     .0842485    .1200368
       1905  |   .1051936    .009558    11.01   0.000     .0864572    .1239301
       1906  |   .1286927   .0095052    13.54   0.000     .1100597    .1473257
       1907  |   .1832709   .0112352    16.31   0.000     .1612468    .2052951
       1908  |   .1387746   .0100782    13.77   0.000     .1190183    .1585308
       1909  |   .1681334   .0113596    14.80   0.000     .1458653    .1904015
       1910  |   .1378582   .0100274    13.75   0.000     .1182015    .1575149
       1911  |   .1661991   .0110545    15.03   0.000     .1445292    .1878691
       1912  |   .1884355   .0114008    16.53   0.000     .1660866    .2107845
       1913  |   .1517959   .0112808    13.46   0.000     .1296822    .1739096
       1914  |    .234887   .0137506    17.08   0.000     .2079319    .2618421
       1915  |   .2858133   .0161845    17.66   0.000     .2540869    .3175397
       1916  |   .3296224   .0184583    17.86   0.000     .2934387    .3658061
       1917  |   .3197617   .0164173    19.48   0.000     .2875789    .3519444
       1918  |   .2911919    .016497    17.65   0.000     .2588529    .3235308
       1919  |   .2680799    .014179    18.91   0.000      .240285    .2958749
       1920  |   .2611867   .0147099    17.76   0.000     .2323509    .2900224
       1921  |   .3044411   .0155398    19.59   0.000     .2739786    .3349036
       1922  |   .3136691   .0153439    20.44   0.000     .2835906    .3437476
       1923  |   .2751237   .0150698    18.26   0.000     .2455825     .304665
       1924  |   .3193804   .0161701    19.75   0.000     .2876824    .3510784
       1925  |   .3194732   .0161085    19.83   0.000     .2878958    .3510507
       1926  |   .3613512   .0158233    22.84   0.000     .3303329    .3923695
       1927  |   .2953188   .0140671    20.99   0.000     .2677431    .3228945
       1928  |   .3029819   .0140577    21.55   0.000     .2754246    .3305391
       1929  |   .3560523   .0152165    23.40   0.000     .3262234    .3858811
       1930  |   .3712471   .0153814    24.14   0.000      .341095    .4013992
       1931  |   .5439906   .0199667    27.24   0.000     .5048501    .5831311
       1932  |   .5800404   .0206558    28.08   0.000     .5395491    .6205317
       1933  |   .5958533   .0188994    31.53   0.000     .5588049    .6329017
       1934  |   .6196238   .0188881    32.81   0.000     .5825977    .6566499
       1935  |   .5895075   .0182188    32.36   0.000     .5537934    .6252216
       1936  |   .6620553   .0193998    34.13   0.000     .6240261    .7000846
       1937  |   .6215029   .0175883    35.34   0.000     .5870247     .655981
       1938  |   .6575614   .0185519    35.44   0.000     .6211942    .6939287
       1939  |   .7821861   .0216041    36.21   0.000     .7398358    .8245364
             |
       _cons |   .1064026   .0075781    14.04   0.000     .0915473     .121258
-------------+----------------------------------------------------------------
     sigma_u |  .66441134
     sigma_e |  .89106385
         rho |  .35731677   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo col1

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. *replicating column 2: DiD without foreign inventor controls
. xtreg count_usa did i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0629                                         min =         65
     Between = 0.0004                                         avg =       65.0
     Overall = 0.0400                                         max =         65

                                                F(65, 7247)       =      42.18
corr(u_i, Xb) = -0.0033                         Prob > F          =     0.0000

                           (Std. err. adjusted for 7,248 clusters in class_id)
------------------------------------------------------------------------------
             |               Robust
   count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         did |   .2553208   .0376449     6.78   0.000     .1815258    .3291157
             |
      grntyr |
       1876  |   .0048289   .0055588     0.87   0.385    -.0060679    .0157257
       1877  |   .0030353   .0060494     0.50   0.616    -.0088232    .0148939
       1878  |  -.0129691   .0059588    -2.18   0.030      -.02465   -.0012882
       1879  |  -.0033113   .0060557    -0.55   0.585    -.0151821    .0085596
       1880  |   .0055188   .0059508     0.93   0.354    -.0061465     .017184
       1881  |   .0023455   .0061694     0.38   0.704    -.0097484    .0144393
       1882  |   .0408389   .0069268     5.90   0.000     .0272603    .0544175
       1883  |   .0604305   .0074661     8.09   0.000     .0457948    .0750662
       1884  |   .0411148    .007502     5.48   0.000     .0264087    .0558208
       1885  |   .0840232   .0081282    10.34   0.000     .0680895    .0999569
       1886  |   .0543598   .0072789     7.47   0.000     .0400911    .0686286
       1887  |   .0415287   .0069851     5.95   0.000     .0278358    .0552216
       1888  |   .0463576   .0069495     6.67   0.000     .0327346    .0599806
       1889  |   .0710541   .0076536     9.28   0.000     .0560509    .0860573
       1890  |   .0917494    .008533    10.75   0.000     .0750224    .1084765
       1891  |   .0750552   .0078655     9.54   0.000     .0596365    .0904739
       1892  |   .0485651   .0076392     6.36   0.000       .03359    .0635403
       1893  |   .0808499   .0079179    10.21   0.000     .0653284    .0963714
       1894  |   .0437362   .0074247     5.89   0.000     .0291817    .0582907
       1895  |   .0665011    .007864     8.46   0.000     .0510853    .0819169
       1896  |   .0689845    .008731     7.90   0.000     .0518693    .0860998
       1897  |   .0838852   .0100163     8.37   0.000     .0642504      .10352
       1898  |   .0525662   .0093129     5.64   0.000     .0343102    .0708222
       1899  |   .1278974   .0105237    12.15   0.000     .1072677     .148527
       1900  |   .1051325   .0091904    11.44   0.000     .0871167    .1231482
       1901  |   .1110651   .0095816    11.59   0.000     .0922824    .1298478
       1902  |   .1110651   .0088931    12.49   0.000      .093632    .1284982
       1903  |   .1399007   .0095163    14.70   0.000     .1212459    .1585554
       1904  |   .1236203   .0092062    13.43   0.000     .1055734    .1416672
       1905  |   .1262417   .0097098    13.00   0.000     .1072077    .1452757
       1906  |   .1481788   .0097013    15.27   0.000     .1291614    .1671962
       1907  |   .2070916   .0116534    17.77   0.000     .1842476    .2299356
       1908  |   .1634934    .010318    15.85   0.000      .143267    .1837197
       1909  |    .191915   .0115894    16.56   0.000     .1691964    .2146336
       1910  |   .1636313   .0103481    15.81   0.000      .143346    .1839167
       1911  |    .191777   .0116102    16.52   0.000     .1690176    .2145365
       1912  |    .214404   .0118901    18.03   0.000      .191096     .237712
       1913  |   .1737031   .0118029    14.72   0.000      .150566    .1968402
       1914  |   .2582781   .0144028    17.93   0.000     .2300446    .2865117
       1915  |   .3087748   .0171144    18.04   0.000     .2752256     .342324
       1916  |   .3519592   .0193553    18.18   0.000     .3140171    .3899013
       1917  |    .339404   .0170654    19.89   0.000     .3059507    .3728572
       1918  |   .3076711   .0171027    17.99   0.000     .2741448    .3411973
       1919  |   .2763814   .0145929    18.94   0.000      .247775    .3049877
       1920  |   .2700348   .0151828    17.79   0.000     .2402721    .2997975
       1921  |   .3165304   .0159486    19.85   0.000     .2852664    .3477944
       1922  |   .3303273   .0157578    20.96   0.000     .2994374    .3612172
       1923  |   .2904542   .0153924    18.87   0.000     .2602806    .3206278
       1924  |   .3376397   .0165722    20.37   0.000     .3051534     .370126
       1925  |   .3517125   .0167618    20.98   0.000     .3188544    .3845706
       1926  |   .3867567   .0163854    23.60   0.000     .3546366    .4188767
       1927  |    .318186   .0146779    21.68   0.000      .289413     .346959
       1928  |   .3379156   .0146061    23.14   0.000     .3092834    .3665478
       1929  |   .4046926   .0162211    24.95   0.000     .3728945    .4364908
       1930  |   .4197313   .0164103    25.58   0.000     .3875622    .4519003
       1931  |   .6181308   .0214678    28.79   0.000     .5760478    .6602139
       1932  |   .6833902   .0220455    31.00   0.000     .6401747    .7266058
       1933  |   .6810447   .0201058    33.87   0.000     .6416315     .720458
       1934  |   .6923582    .020181    34.31   0.000     .6527976    .7319188
       1935  |   .6622809    .019192    34.51   0.000     .6246589    .6999029
       1936  |   .7427169   .0205839    36.08   0.000     .7023665    .7830673
       1937  |   .7011882   .0186114    37.68   0.000     .6647044     .737672
       1938  |   .7507191   .0194851    38.53   0.000     .7125226    .7889157
       1939  |   .8835834   .0227057    38.91   0.000     .8390735    .9280932
             |
       _cons |   .1094095   .0076652    14.27   0.000     .0943835    .1244354
-------------+----------------------------------------------------------------
     sigma_u |  .68428054
     sigma_e |  .89990154
         rho |  .36636691   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo col2 // saving results for table 

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * replicating column 3: intensive margin - # of enemy patents
. xtreg count_usa count_cl count_cl_2 count_for i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0813                                         min =         65
     Between = 0.1452                                         avg =       65.0
     Overall = 0.0735                                         max =         65

                                                F(67, 7247)       =      44.31
corr(u_i, Xb) = 0.0638                          Prob > F          =     0.0000

                           (Std. err. adjusted for 7,248 clusters in class_id)
------------------------------------------------------------------------------
             |               Robust
   count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    count_cl |   .1094904   .0245772     4.45   0.000      .061312    .1576688
  count_cl_2 |  -.0067921   .0021807    -3.11   0.002     -.011067   -.0025172
   count_for |     .28206   .0175663    16.06   0.000     .2476249    .3164952
             |
      grntyr |
       1876  |   .0044008   .0055804     0.79   0.430    -.0065384    .0153401
       1877  |   .0020235   .0060471     0.33   0.738    -.0098306    .0138776
       1878  |   -.013475    .005945    -2.27   0.023    -.0251289   -.0018211
       1879  |   -.004829   .0060632    -0.80   0.426    -.0167146    .0070566
       1880  |   .0039232     .00597     0.66   0.511    -.0077797    .0156261
       1881  |  -.0023244   .0062123    -0.37   0.708    -.0145024    .0098536
       1882  |   .0342621   .0069452     4.93   0.000     .0206476    .0478766
       1883  |   .0550212   .0074582     7.38   0.000      .040401    .0696414
       1884  |   .0348494   .0074535     4.68   0.000     .0202384    .0494604
       1885  |   .0783026   .0081154     9.65   0.000      .062394    .0942112
       1886  |    .049651   .0072537     6.84   0.000     .0354317    .0638703
       1887  |   .0358081   .0069914     5.12   0.000      .022103    .0495132
       1888  |   .0372125   .0069183     5.38   0.000     .0236505    .0507744
       1889  |   .0606247   .0076481     7.93   0.000     .0456323    .0756171
       1890  |   .0799191   .0085093     9.39   0.000     .0632384    .0965999
       1891  |   .0628357   .0078094     8.05   0.000     .0475269    .0781445
       1892  |   .0382136   .0076112     5.02   0.000     .0232934    .0531338
       1893  |   .0661398   .0078102     8.47   0.000     .0508296      .08145
       1894  |    .028598   .0073274     3.90   0.000     .0142343    .0429618
       1895  |   .0536979   .0077787     6.90   0.000     .0384494    .0689464
       1896  |   .0552084   .0086409     6.39   0.000     .0382698    .0721471
       1897  |   .0662175   .0097983     6.76   0.000       .04701    .0854251
       1898  |   .0301119   .0090933     3.31   0.001     .0122865    .0479374
       1899  |     .09766    .010263     9.52   0.000     .0775414    .1177785
       1900  |   .0743892   .0090129     8.25   0.000     .0567213     .092057
       1901  |   .0842134   .0093836     8.97   0.000     .0658188    .1026079
       1902  |    .084369   .0087905     9.60   0.000     .0671371    .1016009
       1903  |    .113477   .0093101    12.19   0.000     .0952265    .1317275
       1904  |   .1022167   .0091277    11.20   0.000     .0843238    .1201096
       1905  |   .1052662   .0095572    11.01   0.000     .0865314    .1240011
       1906  |   .1287599    .009505    13.55   0.000     .1101273    .1473926
       1907  |   .1833531   .0112341    16.32   0.000      .161331    .2053752
       1908  |   .1388598   .0100774    13.78   0.000     .1191051    .1586145
       1909  |   .1682154   .0113586    14.81   0.000     .1459492    .1904817
       1910  |   .1379471   .0100263    13.76   0.000     .1182927    .1576015
       1911  |   .1662873   .0110526    15.05   0.000      .144621    .1879537
       1912  |   .1885251   .0113998    16.54   0.000     .1661782    .2108721
       1913  |   .1518715   .0112796    13.46   0.000     .1297601    .1739828
       1914  |   .2349677   .0137496    17.09   0.000     .2080146    .2619209
       1915  |   .2858925   .0161838    17.67   0.000     .2541675    .3176175
       1916  |   .3296995   .0184577    17.86   0.000      .293517    .3658819
       1917  |   .3198294   .0164163    19.48   0.000     .2876487    .3520102
       1918  |   .2912487   .0164966    17.66   0.000     .2589106    .3235868
       1919  |   .2676254   .0141492    18.91   0.000     .2398889    .2953619
       1920  |    .260734   .0146646    17.78   0.000     .2319871     .289481
       1921  |   .3039996   .0154961    19.62   0.000     .2736228    .3343764
       1922  |   .3132434   .0152995    20.47   0.000     .2832519     .343235
       1923  |   .2746935   .0150271    18.28   0.000     .2452359    .3041511
       1924  |   .3189602    .016138    19.76   0.000      .287325    .3505955
       1925  |   .3191013   .0160737    19.85   0.000     .2875921    .3506105
       1926  |   .3609557   .0157873    22.86   0.000      .330008    .3919034
       1927  |   .2949146   .0140193    21.04   0.000     .2674327    .3223964
       1928  |   .3026192   .0140048    21.61   0.000     .2751657    .3300728
       1929  |   .3557369   .0151671    23.45   0.000      .326005    .3854688
       1930  |   .3709312   .0153351    24.19   0.000     .3408699    .4009925
       1931  |   .5437632   .0199179    27.30   0.000     .5047184    .5828081
       1932  |   .5799138   .0206217    28.12   0.000     .5394892    .6203383
       1933  |    .595664   .0188747    31.56   0.000     .5586642    .6326639
       1934  |   .6193916   .0188535    32.85   0.000     .5824331      .65635
       1935  |   .5892754   .0181849    32.40   0.000     .5536277    .6249231
       1936  |   .6618504   .0193842    34.14   0.000     .6238517    .6998491
       1937  |   .6212946   .0175576    35.39   0.000     .5868765    .6557127
       1938  |   .6573996   .0185259    35.49   0.000     .6210835    .6937158
       1939  |   .7820527   .0215866    36.23   0.000     .7397367    .8243687
             |
       _cons |    .106413   .0075797    14.04   0.000     .0915545    .1212714
-------------+----------------------------------------------------------------
     sigma_u |  .66452288
     sigma_e |  .89100521
         rho |  .35742409   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo col3

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * replicating column 4: quality margin - remaining patent lifetime
. xtreg count_usa count_cl count_for i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0813                                         min =         65
     Between = 0.1502                                         avg =       65.0
     Overall = 0.0737                                         max =         65

                                                F(66, 7247)       =      44.53
corr(u_i, Xb) = 0.0648                          Prob > F          =     0.0000

                           (Std. err. adjusted for 7,248 clusters in class_id)
------------------------------------------------------------------------------
             |               Robust
   count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    count_cl |   .0715471   .0171971     4.16   0.000     .0378357    .1052585
   count_for |   .2827645   .0175547    16.11   0.000     .2483522    .3171769
             |
      grntyr |
       1876  |   .0043998   .0055805     0.79   0.430    -.0065397    .0153393
       1877  |    .002021   .0060472     0.33   0.738    -.0098332    .0138752
       1878  |  -.0134763    .005945    -2.27   0.023    -.0251302   -.0018224
       1879  |  -.0048328   .0060633    -0.80   0.425    -.0167186     .007053
       1880  |   .0039192   .0059701     0.66   0.512     -.007784    .0156224
       1881  |  -.0023361   .0062126    -0.38   0.707    -.0145145    .0098424
       1882  |   .0342457   .0069455     4.93   0.000     .0206304     .047861
       1883  |   .0550077   .0074583     7.38   0.000     .0403872    .0696282
       1884  |   .0348337   .0074536     4.67   0.000     .0202226    .0494449
       1885  |   .0782883   .0081156     9.65   0.000     .0623793    .0941973
       1886  |   .0496393   .0072539     6.84   0.000     .0354195     .063859
       1887  |   .0357938   .0069916     5.12   0.000     .0220882    .0494994
       1888  |   .0371896   .0069186     5.38   0.000     .0236271    .0507522
       1889  |   .0605987   .0076485     7.92   0.000     .0456054    .0755919
       1890  |   .0798896   .0085098     9.39   0.000     .0632079    .0965713
       1891  |   .0628052   .0078098     8.04   0.000     .0474956    .0781147
       1892  |   .0381877   .0076115     5.02   0.000      .023267    .0531084
       1893  |   .0661031   .0078104     8.46   0.000     .0507923    .0814138
       1894  |   .0285602   .0073277     3.90   0.000     .0141958    .0429247
       1895  |   .0536659    .007779     6.90   0.000     .0384168     .068915
       1896  |    .055174   .0086414     6.38   0.000     .0382344    .0721136
       1897  |   .0661734   .0097986     6.75   0.000     .0469654    .0853815
       1898  |   .0300559   .0090937     3.31   0.001     .0122296    .0478821
       1899  |   .0975844   .0102639     9.51   0.000     .0774642    .1177046
       1900  |   .0743124   .0090148     8.24   0.000     .0566407     .091984
       1901  |   .0841463   .0093843     8.97   0.000     .0657503    .1025423
       1902  |   .0843024   .0087914     9.59   0.000     .0670686    .1015361
       1903  |    .113411   .0093118    12.18   0.000     .0951571    .1316649
       1904  |   .1021633   .0091278    11.19   0.000     .0842702    .1200564
       1905  |   .1052138   .0095584    11.01   0.000     .0864765    .1239512
       1906  |   .1287114   .0095043    13.54   0.000     .1100803    .1473426
       1907  |   .1832938   .0112355    16.31   0.000      .161269    .2053187
       1908  |   .1387983   .0100774    13.77   0.000     .1190436     .158553
       1909  |   .1681562   .0113603    14.80   0.000     .1458867    .1904257
       1910  |   .1378829   .0100273    13.75   0.000     .1182264    .1575394
       1911  |   .1662237   .0110548    15.04   0.000      .144553    .1878944
       1912  |   .1884605   .0114011    16.53   0.000     .1661109    .2108101
       1913  |   .1518169     .01128    13.46   0.000     .1297049    .1739289
       1914  |   .2349095   .0137507    17.08   0.000      .207954     .261865
       1915  |   .2858353   .0161847    17.66   0.000     .2541086    .3175621
       1916  |   .3296439     .01846    17.86   0.000     .2934569    .3658308
       1917  |   .3197806   .0164185    19.48   0.000     .2875955    .3519657
       1918  |   .2912077   .0164975    17.65   0.000     .2588678    .3235476
       1919  |   .2690486    .014091    19.09   0.000     .2414262    .2966711
       1920  |   .2621559   .0145738    17.99   0.000     .2335871    .2907247
       1921  |   .3054134   .0154376    19.78   0.000     .2751512    .3356757
       1922  |   .3146458   .0152423    20.64   0.000     .2847665    .3445252
       1923  |   .2760992   .0149625    18.45   0.000     .2467683    .3054301
       1924  |   .3203587   .0160714    19.93   0.000     .2888541    .3518632
       1925  |    .320465   .0160007    20.03   0.000     .2890988    .3518311
       1926  |   .3623363    .015716    23.06   0.000     .3315285    .3931442
       1927  |   .2963015   .0139477    21.24   0.000     .2689599    .3236431
       1928  |   .3039762   .0139501    21.79   0.000     .2766299    .3313225
       1929  |   .3570597   .0150912    23.66   0.000     .3274766    .3866428
       1930  |   .3722544   .0152667    24.38   0.000     .3423272    .4021816
       1931  |   .5450226   .0198562    27.45   0.000     .5060987    .5839465
       1932  |   .5811004   .0205835    28.23   0.000     .5407507    .6214501
       1933  |   .5968959   .0188403    31.68   0.000     .5599634    .6338283
       1934  |   .6206544   .0188167    32.98   0.000     .5837683    .6575405
       1935  |   .5905381   .0181283    32.58   0.000     .5550015    .6260748
       1936  |   .6630935   .0193531    34.26   0.000     .6251558    .7010313
       1937  |   .6225402   .0175358    35.50   0.000     .5881649    .6569154
       1938  |   .6586117   .0185003    35.60   0.000     .6223456    .6948777
       1939  |   .7832442   .0215625    36.32   0.000     .7409755    .8255129
             |
       _cons |   .1064055   .0075778    14.04   0.000     .0915509    .1212601
-------------+----------------------------------------------------------------
     sigma_u |  .66432806
     sigma_e |  .89103017
         rho |  .35727656   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo col4

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * writing reproduced table to log file
. esttab col1 col2 col3 col4, ///
> b(%9.4f) se(%9.4f) ///
> nodepvars obslast nobaselevels alignment(r) ///
> star(* 0.10 ** 0.05 *** 0.01) ///
> keep(did count_cl count_cl_2 count_for) ///
> title("Table 2 Replication: OLS regressions, Dependent Variable = US patents per subclas
> s-year (1875–1939)") ///
> mtitles("(1)" "(2)" "(3)" "(4)") ///
> coeflabels(did "Subclass has at least one license" count_cl "Number of licenses" ///
>         count_cl_2 "Number of licenses squared" ///
>         count_for "Number of patents by foreign inventors") ///
> stats(subclass_fe year_fe N N_g, fmt(%9s %9s %9.0fc %9.0fc) ///
> labels("Subclass fixed effects" "Year fixed effects" "Observations" ///
> "Number of subclasses")) ///
> order(did count_cl count_cl_2 count_for) ///
> nonotes addnotes("Notes: Each observation is a USPTO subclass in a given year (1875–1939
> ). 'count_usa' is the number of patents granted to U.S. inventors in that subclass-year.
>  All regressions include subclass fixed effects and grant-year fixed effects. Standard e
> rrors are clustered at the subclass level. *** p<0.01, ** p<0.05, * p<0.10.")

Table 2 Replication: OLS regressions, Dependent Variable = US patents per subclass-year (1
> 875–1939)
----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                      (1)             (2)             (3)             (4)   
----------------------------------------------------------------------------
Subclass h~s       0.1505***       0.2553***                                
                 (0.0356)        (0.0376)                                   

Number of ~s                                       0.1095***       0.0715***
                                                 (0.0246)        (0.0172)   

Number of ~d                                      -0.0068***                
                                                 (0.0022)                   

Number of ~v       0.2830***                       0.2821***       0.2828***
                 (0.0176)                        (0.0176)        (0.0176)   
----------------------------------------------------------------------------
Subclass f~s          Yes             Yes             Yes             Yes   
Year fixed~s          Yes             Yes             Yes             Yes   
Observations      471,120         471,120         471,120         471,120   
Number of ~s        7,248           7,248           7,248           7,248   
----------------------------------------------------------------------------
Notes: Each observation is a USPTO subclass in a given year (1875–1939). 'count_usa' is th
> e number of patents granted to U.S. inventors in that subclass-year. All regressions inc
> lude subclass fixed effects and grant-year fixed effects. Standard errors are clustered 
> at the subclass level. *** p<0.01, ** p<0.05, * p<0.10.

.         
. * writing reproduced table to LaTex
. esttab col1 col2 col3 col4 using "table2_results.tex", ///
> replace ///
> b(%9.4f) se(%9.4f) ///
> nodepvars obslast nobaselevels booktabs ///
> alignment(D{.}{.}{-1}) ///
> collabels(none) eqlabels(none) varwidth(60) ///
> star(* 0.10 ** 0.05 *** 0.01) ///
> keep(did count_cl count_cl_2 count_for) ///
> title("Table 2 Replication: OLS regressions, Dependent Variable = US patents per subclas
> s-year (1875–1939)") ///
> mtitles("(1)" "(2)" "(3)" "(4)") ///
> coeflabels(did "Subclass has at least one license" count_cl "Number of licenses" ///
>         count_cl_2 "Number of licenses squared" ///
>         count_for "Number of patents by foreign inventors") ///
> stats(subclass_fe year_fe N N_g, fmt(%9s %9s %9.0fc %9.0fc) ///
> labels("Subclass fixed effects" "Year fixed effects" "Observations" ///
> "Number of subclasses")) ///
> order(did count_cl count_cl_2 count_for) ///
> nonotes addnotes("Notes: Each observation is a USPTO subclass in a given year (1875–1939
> ). 'count_usa' is the number of patents granted to U.S. inventors in that subclass-year.
>  All regressions include subclass fixed effects and grant-year fixed effects. Standard e
> rrors are clustered at the subclass level. *** p<0.01, ** p<0.05, * p<0.10.")
(output written to table2_results.tex)

. 
. 
. *=============================== TABLE 3 ======================================*
. 
. * setting up the panel
. xtset class_id grntyr

Panel variable: class_id (strongly balanced)
 Time variable: grntyr, 1875 to 1939
         Delta: 1 unit

. 
. * verifying observations and # of subclasses 
. count
  471,120

. quietly levelsof class_id, local(cls)

. display "Observations = " r(N)
Observations = 471120

. display "Number of subclasses = " wordcount("`cls'")
Number of subclasses = 7248

. 
. * clearing saved columns for new table
. eststo clear

. 
. * replicating column 1
. xtreg count_usa count_cl_itt count_for i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0825                                         min =         65
     Between = 0.1066                                         avg =       65.0
     Overall = 0.0737                                         max =         65

                                                F(66, 7247)       =      44.81
corr(u_i, Xb) = 0.0576                          Prob > F          =     0.0000

                           (Std. err. adjusted for 7,248 clusters in class_id)
------------------------------------------------------------------------------
             |               Robust
   count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
count_cl_itt |   .0549944   .0069515     7.91   0.000     .0413675    .0686213
   count_for |   .2791404   .0173587    16.08   0.000     .2451122    .3131686
             |
      grntyr |
       1876  |   .0044053     .00558     0.79   0.430    -.0065332    .0153437
       1877  |    .002034   .0060469     0.34   0.737    -.0098196    .0138876
       1878  |  -.0134698   .0059448    -2.27   0.023    -.0251234   -.0018162
       1879  |  -.0048133   .0060628    -0.79   0.427    -.0166981    .0070716
       1880  |   .0039397   .0059696     0.66   0.509    -.0077624    .0156419
       1881  |  -.0022761   .0062116    -0.37   0.714    -.0144526    .0099005
       1882  |   .0343302   .0069434     4.94   0.000      .020719    .0479414
       1883  |   .0550772   .0074575     7.39   0.000     .0404583     .069696
       1884  |   .0349142   .0074532     4.68   0.000     .0203037    .0495248
       1885  |   .0783618    .008115     9.66   0.000      .062454    .0942696
       1886  |   .0496998   .0072533     6.85   0.000     .0354812    .0639183
       1887  |   .0358673   .0069904     5.13   0.000     .0221641    .0495706
       1888  |   .0373071   .0069175     5.39   0.000     .0237467    .0508675
       1889  |   .0607327    .007647     7.94   0.000     .0457424    .0757229
       1890  |   .0800416   .0085076     9.41   0.000     .0633643    .0967189
       1891  |   .0629622   .0078083     8.06   0.000     .0476556    .0782688
       1892  |   .0383207     .00761     5.04   0.000     .0234029    .0532386
       1893  |   .0662921   .0078096     8.49   0.000      .050983    .0816011
       1894  |   .0287547   .0073257     3.93   0.000     .0143943    .0431152
       1895  |   .0538304   .0077777     6.92   0.000     .0385838     .069077
       1896  |    .055351   .0086396     6.41   0.000     .0384148    .0722872
       1897  |   .0664004   .0097976     6.78   0.000     .0471942    .0856066
       1898  |   .0303444   .0090913     3.34   0.001     .0125227     .048166
       1899  |   .0979729   .0102613     9.55   0.000     .0778577    .1180882
       1900  |   .0747074   .0090081     8.29   0.000     .0570488    .0923659
       1901  |   .0844913   .0093792     9.01   0.000     .0661054    .1028773
       1902  |   .0846454   .0087873     9.63   0.000     .0674198     .101871
       1903  |   .1137505   .0093066    12.22   0.000     .0955068    .1319942
       1904  |   .1024383   .0091256    11.23   0.000     .0845495    .1203271
       1905  |   .1054833   .0095556    11.04   0.000     .0867516    .1242151
       1906  |   .1289609   .0095024    13.57   0.000     .1103335    .1475884
       1907  |   .1835988   .0112341    16.34   0.000     .1615767     .205621
       1908  |   .1391148   .0100749    13.81   0.000      .119365    .1588646
       1909  |   .1684607   .0113576    14.83   0.000     .1461966    .1907249
       1910  |   .1382129   .0100219    13.79   0.000     .1185671    .1578588
       1911  |   .1665512   .0110478    15.08   0.000     .1448942    .1882082
       1912  |    .188793   .0113971    16.56   0.000     .1664513    .2111347
       1913  |   .1520974   .0112783    13.49   0.000     .1299887    .1742062
       1914  |    .235209   .0137485    17.11   0.000     .2082579    .2621602
       1915  |   .2861293   .0161857    17.68   0.000     .2544007     .317858
       1916  |   .3299299   .0184581    17.87   0.000     .2937466    .3661131
       1917  |   .3200321   .0164169    19.49   0.000     .2878501     .352214
       1918  |   .2914187    .016497    17.66   0.000     .2590797    .3237577
       1919  |    .251869   .0144485    17.43   0.000     .2235458    .2801922
       1920  |   .2449833   .0149588    16.38   0.000     .2156596     .274307
       1921  |   .2882823   .0156949    18.37   0.000     .2575158    .3190488
       1922  |   .2975732   .0155159    19.18   0.000     .2671575    .3279889
       1923  |   .2590096   .0152937    16.94   0.000     .2290295    .2889897
       1924  |   .3033066   .0163763    18.52   0.000     .2712043    .3354089
       1925  |   .3035919   .0162839    18.64   0.000     .2716708     .335513
       1926  |   .3453757   .0160008    21.58   0.000     .3140095    .3767419
       1927  |   .2793084   .0142467    19.61   0.000     .2513808    .3072361
       1928  |   .2871376   .0142602    20.14   0.000     .2591834    .3150917
       1929  |   .3403966     .01539    22.12   0.000     .3102277    .3705655
       1930  |   .3555893    .015557    22.86   0.000     .3250931    .3860856
       1931  |    .528686   .0200583    26.36   0.000     .4893658    .5680062
       1932  |   .5651378   .0207278    27.26   0.000     .5245054    .6057703
       1933  |   .5807008   .0189502    30.64   0.000     .5435528    .6178488
       1934  |   .6042998   .0189048    31.97   0.000     .5672408    .6413588
       1935  |   .5741841   .0183702    31.26   0.000     .5381731     .610195
       1936  |   .6468405   .0193948    33.35   0.000      .608821    .6848599
       1937  |   .6062746   .0176386    34.37   0.000     .5716979    .6408513
       1938  |   .6425186   .0185954    34.55   0.000     .6060661    .6789711
       1939  |   .7672566   .0216344    35.46   0.000     .7248469    .8096664
             |
       _cons |    .106444   .0075855    14.03   0.000     .0915743    .1213137
-------------+----------------------------------------------------------------
     sigma_u |  .66484342
     sigma_e |  .89042143
         rho |  .35794684   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo column1

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * replicating column 2: isolates ITT enemy exposure w/o controlling for foreign patents
. xtreg count_usa count_cl_itt i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0647                                         min =         65
     Between = 0.0011                                         avg =       65.0
     Overall = 0.0421                                         max =         65

                                                F(65, 7247)       =      41.90
corr(u_i, Xb) = -0.0019                         Prob > F          =     0.0000

                           (Std. err. adjusted for 7,248 clusters in class_id)
------------------------------------------------------------------------------
             |               Robust
   count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
count_cl_itt |   .0697671   .0083828     8.32   0.000     .0533343       .0862
             |
      grntyr |
       1876  |   .0048289   .0055588     0.87   0.385    -.0060679    .0157257
       1877  |   .0030353   .0060494     0.50   0.616    -.0088232    .0148939
       1878  |  -.0129691   .0059588    -2.18   0.030      -.02465   -.0012882
       1879  |  -.0033113   .0060557    -0.55   0.585    -.0151821    .0085596
       1880  |   .0055188   .0059508     0.93   0.354    -.0061465     .017184
       1881  |   .0023455   .0061694     0.38   0.704    -.0097484    .0144393
       1882  |   .0408389   .0069268     5.90   0.000     .0272603    .0544175
       1883  |   .0604305   .0074661     8.09   0.000     .0457948    .0750662
       1884  |   .0411148    .007502     5.48   0.000     .0264087    .0558208
       1885  |   .0840232   .0081282    10.34   0.000     .0680895    .0999569
       1886  |   .0543598   .0072789     7.47   0.000     .0400911    .0686286
       1887  |   .0415287   .0069851     5.95   0.000     .0278358    .0552216
       1888  |   .0463576   .0069495     6.67   0.000     .0327346    .0599806
       1889  |   .0710541   .0076536     9.28   0.000     .0560509    .0860573
       1890  |   .0917494    .008533    10.75   0.000     .0750224    .1084765
       1891  |   .0750552   .0078655     9.54   0.000     .0596365    .0904739
       1892  |   .0485651   .0076392     6.36   0.000       .03359    .0635403
       1893  |   .0808499   .0079179    10.21   0.000     .0653284    .0963714
       1894  |   .0437362   .0074247     5.89   0.000     .0291817    .0582907
       1895  |   .0665011    .007864     8.46   0.000     .0510853    .0819169
       1896  |   .0689845    .008731     7.90   0.000     .0518693    .0860998
       1897  |   .0838852   .0100163     8.37   0.000     .0642504      .10352
       1898  |   .0525662   .0093129     5.64   0.000     .0343102    .0708222
       1899  |   .1278974   .0105237    12.15   0.000     .1072677     .148527
       1900  |   .1051325   .0091904    11.44   0.000     .0871167    .1231482
       1901  |   .1110651   .0095816    11.59   0.000     .0922824    .1298478
       1902  |   .1110651   .0088931    12.49   0.000      .093632    .1284982
       1903  |   .1399007   .0095163    14.70   0.000     .1212459    .1585554
       1904  |   .1236203   .0092062    13.43   0.000     .1055734    .1416672
       1905  |   .1262417   .0097098    13.00   0.000     .1072077    .1452757
       1906  |   .1481788   .0097013    15.27   0.000     .1291614    .1671962
       1907  |   .2070916   .0116534    17.77   0.000     .1842476    .2299356
       1908  |   .1634934    .010318    15.85   0.000      .143267    .1837197
       1909  |    .191915   .0115894    16.56   0.000     .1691964    .2146336
       1910  |   .1636313   .0103481    15.81   0.000      .143346    .1839167
       1911  |    .191777   .0116102    16.52   0.000     .1690176    .2145365
       1912  |    .214404   .0118901    18.03   0.000      .191096     .237712
       1913  |   .1737031   .0118029    14.72   0.000      .150566    .1968402
       1914  |   .2582781   .0144028    17.93   0.000     .2300446    .2865117
       1915  |   .3087748   .0171144    18.04   0.000     .2752256     .342324
       1916  |   .3519592   .0193553    18.18   0.000     .3140171    .3899013
       1917  |    .339404   .0170654    19.89   0.000     .3059507    .3728572
       1918  |   .3076711   .0171027    17.99   0.000     .2741448    .3411973
       1919  |   .2585703   .0149252    17.32   0.000     .2293125     .287828
       1920  |   .2522237   .0154689    16.31   0.000     .2219001    .2825473
       1921  |   .2987193   .0161511    18.50   0.000     .2670584    .3303801
       1922  |   .3125162   .0159744    19.56   0.000     .2812017    .3438306
       1923  |   .2726431   .0156674    17.40   0.000     .2419305    .3033557
       1924  |   .3198285   .0168096    19.03   0.000     .2868769    .3527802
       1925  |   .3339014   .0169383    19.71   0.000     .3006973    .3671055
       1926  |   .3689455   .0165733    22.26   0.000      .336457     .401434
       1927  |   .3003749   .0148487    20.23   0.000     .2712671    .3294827
       1928  |   .3201045   .0147942    21.64   0.000     .2911035    .3491054
       1929  |   .3868815   .0163489    23.66   0.000     .3548329    .4189301
       1930  |   .4019201    .016525    24.32   0.000     .3695263     .434314
       1931  |   .6003197   .0214899    27.93   0.000     .5581931    .6424463
       1932  |   .6655791   .0220389    30.20   0.000     .6223764    .7087818
       1933  |   .6632336    .020052    33.08   0.000     .6239259    .7025414
       1934  |   .6745471   .0201255    33.52   0.000     .6350952    .7139989
       1935  |   .6444698   .0193273    33.35   0.000     .6065827     .682357
       1936  |   .7249058   .0204821    35.39   0.000     .6847549    .7650567
       1937  |   .6833771   .0186385    36.66   0.000     .6468402     .719914
       1938  |    .732908   .0194221    37.74   0.000     .6948351    .7709809
       1939  |   .8657722   .0226472    38.23   0.000     .8213772    .9101673
             |
       _cons |   .1094095   .0076613    14.28   0.000     .0943911    .1244279
-------------+----------------------------------------------------------------
     sigma_u |   .6834266
     sigma_e |  .89902798
         rho |  .36623807   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo column2

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * replicating column 3: remaining lifetime of enemy patents
. xtreg count_usa year_conf_itt count_for i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0826                                         min =         65
     Between = 0.1080                                         avg =       65.0
     Overall = 0.0738                                         max =         65

                                                F(66, 7247)       =      44.89
corr(u_i, Xb) = 0.0580                          Prob > F          =     0.0000

                            (Std. err. adjusted for 7,248 clusters in class_id)
-------------------------------------------------------------------------------
              |               Robust
    count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
year_conf_itt |   .0065338   .0008242     7.93   0.000     .0049181    .0081495
    count_for |   .2784628   .0173632    16.04   0.000      .244426    .3124997
              |
       grntyr |
        1876  |   .0044063   .0055799     0.79   0.430    -.0065319    .0153445
        1877  |   .0020364   .0060468     0.34   0.736     -.009817    .0138899
        1878  |  -.0134685   .0059448    -2.27   0.024    -.0251221    -.001815
        1879  |  -.0048096   .0060627    -0.79   0.428    -.0166942     .007075
        1880  |   .0039436   .0059695     0.66   0.509    -.0077583    .0156455
        1881  |  -.0022648   .0062112    -0.36   0.715    -.0144407     .009911
        1882  |    .034346   .0069431     4.95   0.000     .0207355    .0479565
        1883  |   .0550902   .0074572     7.39   0.000     .0404719    .0697084
        1884  |   .0349293   .0074531     4.69   0.000      .020319    .0495395
        1885  |   .0783755   .0081148     9.66   0.000     .0624681    .0942829
        1886  |   .0497111   .0072531     6.85   0.000     .0354929    .0639293
        1887  |   .0358811   .0069902     5.13   0.000     .0221782    .0495839
        1888  |   .0373291   .0069171     5.40   0.000     .0237695    .0508887
        1889  |   .0607577   .0076466     7.95   0.000     .0457681    .0757473
        1890  |     .08007   .0085068     9.41   0.000     .0633941    .0967458
        1891  |   .0629915   .0078078     8.07   0.000     .0476859    .0782972
        1892  |   .0383456   .0076096     5.04   0.000     .0234285    .0532627
        1893  |   .0663274   .0078095     8.49   0.000     .0510185    .0816363
        1894  |   .0287911   .0073249     3.93   0.000     .0144322      .04315
        1895  |   .0538612   .0077775     6.93   0.000      .038615    .0691073
        1896  |   .0553841   .0086395     6.41   0.000     .0384481    .0723201
        1897  |   .0664429   .0097972     6.78   0.000     .0472376    .0856482
        1898  |   .0303983   .0090905     3.34   0.001     .0125782    .0482184
        1899  |   .0980456   .0102595     9.56   0.000     .0779339    .1181572
        1900  |   .0747812   .0090062     8.30   0.000     .0571264    .0924361
        1901  |   .0845558   .0093775     9.02   0.000     .0661733    .1029384
        1902  |   .0847095   .0087854     9.64   0.000     .0674875    .1019315
        1903  |    .113814   .0093053    12.23   0.000      .095573     .132055
        1904  |   .1024897   .0091234    11.23   0.000     .0846052    .1203743
        1905  |   .1055337   .0095541    11.05   0.000      .086805    .1242625
        1906  |   .1290076    .009501    13.58   0.000     .1103829    .1476323
        1907  |   .1836559   .0112335    16.35   0.000     .1616349    .2056768
        1908  |    .139174   .0100734    13.82   0.000     .1194272    .1589208
        1909  |   .1685177   .0113565    14.84   0.000     .1462556    .1907798
        1910  |   .1382746   .0100207    13.80   0.000     .1186312    .1579181
        1911  |   .1666124   .0110461    15.08   0.000     .1449588    .1882661
        1912  |   .1888552    .011396    16.57   0.000     .1665158    .2111946
        1913  |   .1521499   .0112773    13.49   0.000     .1300431    .1742567
        1914  |    .235265   .0137475    17.11   0.000     .2083159    .2622142
        1915  |   .2861843    .016185    17.68   0.000     .2544569    .3179117
        1916  |   .3299833   .0184572    17.88   0.000     .2938019    .3661648
        1917  |   .3200791   .0164165    19.50   0.000      .287898    .3522602
        1918  |   .2914582   .0164964    17.67   0.000     .2591204    .3237959
        1919  |   .2517996   .0144546    17.42   0.000     .2234643    .2801349
        1920  |   .2449151   .0149451    16.39   0.000     .2156184    .2742119
        1921  |   .2882219   .0156936    18.37   0.000     .2574579     .318986
        1922  |   .2975238   .0154856    19.21   0.000     .2671675    .3278801
        1923  |    .258957   .0152676    16.96   0.000     .2290281    .2888859
        1924  |    .303261   .0163224    18.58   0.000     .2712643    .3352577
        1925  |   .3035797   .0162399    18.69   0.000     .2717447    .3354147
        1926  |   .3453472   .0159644    21.63   0.000     .3140523    .3766422
        1927  |   .2792738   .0142235    19.63   0.000     .2513916     .307156
        1928  |   .2871319   .0142444    20.16   0.000     .2592088     .315055
        1929  |   .3404238    .015391    22.12   0.000      .310253    .3705945
        1930  |   .3556161   .0155431    22.88   0.000      .325147    .3860851
        1931  |   .5287742   .0200237    26.41   0.000     .4895219    .5680264
        1932  |   .5652959   .0206973    27.31   0.000     .5247232    .6058686
        1933  |   .5808154   .0189666    30.62   0.000     .5436354    .6179954
        1934  |   .6043846   .0189317    31.92   0.000     .5672731    .6414962
        1935  |   .5742689   .0183546    31.29   0.000     .5382886    .6102493
        1936  |   .6469442   .0194046    33.34   0.000     .6089056    .6849828
        1937  |    .606376   .0176422    34.37   0.000     .5717921    .6409599
        1938  |   .6426523   .0186091    34.53   0.000      .606173    .6791316
        1939  |   .7674101   .0216108    35.51   0.000     .7250466    .8097735
              |
        _cons |   .1064512   .0075845    14.04   0.000     .0915834     .121319
--------------+----------------------------------------------------------------
      sigma_u |  .66477088
      sigma_e |  .89037787
          rho |  .35791917   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. eststo column3

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * replicating column 4: only remaining-lifetime effects
. xtreg count_usa year_conf_itt i.grntyr, fe vce(cluster class_id)

Fixed-effects (within) regression               Number of obs     =    471,120
Group variable: class_id                        Number of groups  =      7,248

R-squared:                                      Obs per group:
     Within  = 0.0649                                         min =         65
     Between = 0.0013                                         avg =       65.0
     Overall = 0.0423                                         max =         65

                                                F(65, 7247)       =      41.98
corr(u_i, Xb) = -0.0019                         Prob > F          =     0.0000

                            (Std. err. adjusted for 7,248 clusters in class_id)
-------------------------------------------------------------------------------
              |               Robust
    count_usa | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
year_conf_itt |   .0083577   .0009807     8.52   0.000     .0064353    .0102801
              |
       grntyr |
        1876  |   .0048289   .0055588     0.87   0.385    -.0060679    .0157257
        1877  |   .0030353   .0060494     0.50   0.616    -.0088232    .0148939
        1878  |  -.0129691   .0059588    -2.18   0.030      -.02465   -.0012882
        1879  |  -.0033113   .0060557    -0.55   0.585    -.0151821    .0085596
        1880  |   .0055188   .0059508     0.93   0.354    -.0061465     .017184
        1881  |   .0023455   .0061694     0.38   0.704    -.0097484    .0144393
        1882  |   .0408389   .0069268     5.90   0.000     .0272603    .0544175
        1883  |   .0604305   .0074661     8.09   0.000     .0457948    .0750662
        1884  |   .0411148    .007502     5.48   0.000     .0264087    .0558208
        1885  |   .0840232   .0081282    10.34   0.000     .0680895    .0999569
        1886  |   .0543598   .0072789     7.47   0.000     .0400911    .0686286
        1887  |   .0415287   .0069851     5.95   0.000     .0278358    .0552216
        1888  |   .0463576   .0069495     6.67   0.000     .0327346    .0599806
        1889  |   .0710541   .0076536     9.28   0.000     .0560509    .0860573
        1890  |   .0917494    .008533    10.75   0.000     .0750224    .1084765
        1891  |   .0750552   .0078655     9.54   0.000     .0596365    .0904739
        1892  |   .0485651   .0076392     6.36   0.000       .03359    .0635403
        1893  |   .0808499   .0079179    10.21   0.000     .0653284    .0963714
        1894  |   .0437362   .0074247     5.89   0.000     .0291817    .0582907
        1895  |   .0665011    .007864     8.46   0.000     .0510853    .0819169
        1896  |   .0689845    .008731     7.90   0.000     .0518693    .0860998
        1897  |   .0838852   .0100163     8.37   0.000     .0642504      .10352
        1898  |   .0525662   .0093129     5.64   0.000     .0343102    .0708222
        1899  |   .1278974   .0105237    12.15   0.000     .1072677     .148527
        1900  |   .1051325   .0091904    11.44   0.000     .0871167    .1231482
        1901  |   .1110651   .0095816    11.59   0.000     .0922824    .1298478
        1902  |   .1110651   .0088931    12.49   0.000      .093632    .1284982
        1903  |   .1399007   .0095163    14.70   0.000     .1212459    .1585554
        1904  |   .1236203   .0092062    13.43   0.000     .1055734    .1416672
        1905  |   .1262417   .0097098    13.00   0.000     .1072077    .1452757
        1906  |   .1481788   .0097013    15.27   0.000     .1291614    .1671962
        1907  |   .2070916   .0116534    17.77   0.000     .1842476    .2299356
        1908  |   .1634934    .010318    15.85   0.000      .143267    .1837197
        1909  |    .191915   .0115894    16.56   0.000     .1691964    .2146336
        1910  |   .1636313   .0103481    15.81   0.000      .143346    .1839167
        1911  |    .191777   .0116102    16.52   0.000     .1690176    .2145365
        1912  |    .214404   .0118901    18.03   0.000      .191096     .237712
        1913  |   .1737031   .0118029    14.72   0.000      .150566    .1968402
        1914  |   .2582781   .0144028    17.93   0.000     .2300446    .2865117
        1915  |   .3087748   .0171144    18.04   0.000     .2752256     .342324
        1916  |   .3519592   .0193553    18.18   0.000     .3140171    .3899013
        1917  |    .339404   .0170654    19.89   0.000     .3059507    .3728572
        1918  |   .3076711   .0171027    17.99   0.000     .2741448    .3411973
        1919  |   .2581952   .0149266    17.30   0.000     .2289348    .2874556
        1920  |   .2518486   .0154476    16.30   0.000     .2215668    .2821304
        1921  |   .2983442   .0161498    18.47   0.000      .266686    .3300024
        1922  |   .3121411   .0159409    19.58   0.000     .2808923    .3433899
        1923  |    .272268   .0156366    17.41   0.000     .2416157    .3029204
        1924  |   .3194535   .0167556    19.07   0.000     .2866077    .3522992
        1925  |   .3335263   .0168928    19.74   0.000     .3004114    .3666412
        1926  |   .3685705    .016531    22.30   0.000     .3361648    .4009761
        1927  |   .2999998   .0148174    20.25   0.000     .2709533    .3290463
        1928  |   .3197294   .0147709    21.65   0.000     .2907741    .3486847
        1929  |   .3865064   .0163421    23.65   0.000     .3544711    .4185417
        1930  |   .4015451   .0165013    24.33   0.000     .3691977    .4338924
        1931  |   .5999446   .0214497    27.97   0.000     .5578969    .6419924
        1932  |    .665204   .0219908    30.25   0.000     .6220956    .7083124
        1933  |   .6628585   .0200591    33.05   0.000     .6235369    .7021801
        1934  |    .674172   .0201372    33.48   0.000     .6346973    .7136467
        1935  |   .6440947   .0192954    33.38   0.000     .6062701    .6819194
        1936  |   .7245307   .0204776    35.38   0.000     .6843887    .7646727
        1937  |    .683002   .0186409    36.64   0.000     .6464603    .7195437
        1938  |   .7325329   .0194269    37.71   0.000     .6944506    .7706152
        1939  |   .8653972   .0226154    38.27   0.000     .8210644      .90973
              |
        _cons |   .1094095   .0076608    14.28   0.000      .094392     .124427
--------------+----------------------------------------------------------------
      sigma_u |  .68336056
      sigma_e |  .89893518
          rho |  .36624113   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. eststo column4

. estadd local subclass_fe "Yes"

added macro:
        e(subclass_fe) : "Yes"

. estadd local year_fe     "Yes"

added macro:
            e(year_fe) : "Yes"

. 
. * writing reproduced table to log file
. esttab column1 column2 column3 column4, ///
> b(%9.4f) se(%9.4f) ///
> nodepvars obslast nobaselevels alignment(r) ///
> star(* 0.10 ** 0.05 *** 0.01) ///
> keep(count_cl_itt year_conf_itt count_for) ///
> title("Table 3 Replication: Intent to Treat Regressions, Dependent Variable = US patents
>  per subclass-year (1875–1939)") ///
> mtitles("(1)" "(2)" "(3)" "(4)") ///
> coeflabels(count_cl_itt  "Number of enemy patents" ///
>            year_conf_itt "Remaining lifetime of enemy patents" ///
>            count_for     "Number of patents by foreign inventors") ///
> stats(subclass_fe year_fe N N_g, fmt(%9s %9s %9.0fc %9.0fc) ///
> labels("Subclass fixed effects" "Year fixed effects" "Observations" ///
> "Number of subclasses")) ///
> order(count_cl_itt year_conf_itt count_for) ///
> nonotes addnotes("Notes: Subclass-by-year panel (1875–1939), restricted to chemical subc
> lasses with pre-war German patents. All regressions include subclass and grant-year fixe
> d effects, with standard errors clustered at the subclass level. `count_cl_itt` and  `ye
> ar_conf_itt` measure pre-war exposure to enemy patents (ITT). `count_for` measures paten
> ts by foreign inventors excluding Germans. *** p<0.01, ** p<0.05, * p<0.10.")

Table 3 Replication: Intent to Treat Regressions, Dependent Variable = US patents per subc
> lass-year (1875–1939)
----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                      (1)             (2)             (3)             (4)   
----------------------------------------------------------------------------
Number of ~s       0.0550***       0.0698***                                
                 (0.0070)        (0.0084)                                   

Remaining ~e                                       0.0065***       0.0084***
                                                 (0.0008)        (0.0010)   

Number of ~v       0.2791***                       0.2785***                
                 (0.0174)                        (0.0174)                   
----------------------------------------------------------------------------
Subclass f~s          Yes             Yes             Yes             Yes   
Year fixed~s          Yes             Yes             Yes             Yes   
Observations      471,120         471,120         471,120         471,120   
Number of ~s        7,248           7,248           7,248           7,248   
----------------------------------------------------------------------------
Notes: Subclass-by-year panel (1875–1939), restricted to chemical subclasses with pre-war 
> German patents. All regressions include subclass and grant-year fixed effects, with stan
> dard errors clustered at the subclass level. `count_cl_itt` and  `year_conf_itt` measure
>  pre-war exposure to enemy patents (ITT). `count_for` measures patents by foreign invent
> ors excluding Germans. *** p<0.01, ** p<0.05, * p<0.10.

. 
. * writing reproduced code to LaTex
. esttab column1 column2 column3 column4 using "Table3_results.tex", ///
> replace ///
> b(%9.4f) se(%9.4f) ///
> nodepvars obslast nobaselevels booktabs ///
> alignment(D{.}{.}{-1}) ///
> collabels(none) eqlabels(none) varwidth(60) ///
> star(* 0.10 ** 0.05 *** 0.01) ///
> keep(count_cl_itt year_conf_itt count_for) ///
> title("Table 3 Replication: Intent to Treat Regressions, Dependent Variable = US patents
>  per subclass-year (1875–1939)") ///
> mtitles("(1)" "(2)" "(3)" "(4)") ///
> coeflabels(count_cl_itt  "Number of enemy patents" ///
>            year_conf_itt "Remaining lifetime of enemy patents" ///
>            count_for     "Number of patents by foreign inventors") ///
> stats(subclass_fe year_fe N N_g, fmt(%9s %9s %9.0fc %9.0fc) ///
> labels("Subclass fixed effects" "Year fixed effects" "Observations" ///
> "Number of subclasses")) ///
> order(count_cl_itt year_conf_itt count_for) ///
> nonotes addnotes("Notes: Subclass-by-year panel (1875–1939), restricted to chemical subc
> lasses with pre-war German patents. All regressions include subclass and grant-year fixe
> d effects, with standard errors clustered at the subclass level. `count_cl_itt` and  `ye
> ar_conf_itt` measure pre-war exposure to enemy patents (ITT). `count_for` measures paten
> ts by foreign inventors excluding Germans. *** p<0.01, ** p<0.05, * p<0.10.")
(output written to Table3_results.tex)

. 
. 
end of do-file

